# Матрицы в питоне реализуются в виде вложенных списков:
# Пример. Дано:
# matrix = [[1, 0, 8],
          # [3, 4, 1],
          # [0, 4, 2]]
          
# Выполнить поворот (транспонирование) матрицы
# Пример. Результат:
# matrix_rotate = [[1, 3, 0],
#                  [0, 4, 4],
#                  [8, 1, 2]]

# Суть сложности hard: Решите задачу в одну строку

matrix = [[1, 0, 8],
          [3, 4, 1],
          [0, 4, 2],
          [18, 19, 20]
         ]

rotate_matrix = list(map(list, list(zip(*matrix))))

print('Матрица: ')
for i in matrix:
	print(i)
print('Перевёрнутая матрица: ')
for i in rotate_matrix:
	print(i)
	





